In [19]:
# Imports

import pandas as pd

import cpi

# Loading combined dataset -> see joins for more info
df = pd.read_csv('./finalizedDS/incomeAndPrice.csv')
df.head()

,observation_date,medianHHIncome,date,avgYearPrice,realMedianHHIncome,realHousePrice
0,1984-01-01,22420,1984,79950.0,65749.940712,234465.109721
1,1985-01-01,23620,1985,84275.0,66887.186245,238650.195632
2,1986-01-01,24900,1986,92025.0,69225.180657,255841.255018
3,1987-01-01,26060,1987,104700.0,69899.067958,280830.100352
4,1988-01-01,27230,1988,112225.0,70135.549112,289054.792477

In [22]:
# down payment things
# url: https://www.bankofamerica.com/mortgage/learn/mortgage-down-payment/
df["downPayment20"] = df["realHousePrice"] * 0.20
df["downPayment035"] = df["realHousePrice"] * 0.035
df2 = df[["date", "downPayment20", "downPayment035"]]
df2.head()

   date  downPayment20  downPayment035
0  1984   46893.021944     8206.278840
1  1985   47730.039126     8352.756847
2  1986   51168.251004     8954.443926
3  1987   56166.020070     9829.053512
4  1988   57810.958495    10116.917737

In [23]:
df2.to_csv('./finalizedDS/downPayments.csv', index=False)